{
  "about-1": "👋 Olá, me chamo Lucas, sou um desenvolvedor full-stack com mais de 5 anos de experiência construindo aplicações web e mobile. Tenho 22 anos e atualmente trabalho na Privacy, uma plataforma internacional de mídia social, onde contribuo tanto para o produto principal quanto para sistemas internos.",
  "about-2": "Minha stack principal inclui JavaScript/TypeScript e Python, utilizando frameworks como Vue.js, Node.js, FastAPI e Django. Já trabalhei em projetos diversos nas áreas de finanças, entretenimento, gestão de projetos e equipes, e plataformas SaaS com inteligência artificial.",
  "about-3": "Também tenho forte experiência com infraestrutura em nuvem na AWS e Azure, trabalhando com máquinas virtuais, armazenamento de arquivos, pipelines de CI/CD e arquitetura serverless utilizando AWS Lambda e microsserviços.",
  "about-4": "Estou constantemente aprimorando minhas habilidades através da prática, explorando novas tecnologias e contribuindo para arquiteturas de sistemas escaláveis em diferentes ambientes.",
  "about-5": "Sou apaixonado por inovação e estou sempre buscando maneiras de entregar soluções inteligentes, eficientes e elegantes no mundo da tecnologia.",
  "description-change": "ajuste o tamanho da descrição",
  "small": "pequena",
  "big": "grande",
  "email-error": "Infelizmente ocorreu um erro ;-;, Por favor me envie um email diretamente!",
  "contact": "Contato",
  "follow-social": "Me siga nas redes sociais!",
  "send-email": "Ou me envie um email",
  "my-phone": "Meu número de celular (Whatsapp)",
  "continue": "Continuar",
  "name": "Nome",
  "contact-me": "Entre em contato comigo",
  "phone": "Celular (opcional)",
  "return": "Voltar",
  "send": "Enviar",
  "sended": "Enviado",
  "sending": "Enviando...",

  "know-more": "Quer saber mais?",
  "download-curriculum": "Baixe meu currículo",
  "access": "Acesse online ou",
  "download-doc": "baixe o documento",
  "download": "Baixar",
  "visualization": "Visualizar",
  "thanks": "< Obrigado pela visita >",

  "formation": "Formação",
  "formation-description": "Atualmente sou graduado em design gráfico e estou estudando análise e desenvolvimento de sistemas no Centro Universitário Internacional, a previsão da minha formação em análise e desenvolvimento de sistemas será em fevereiro de 2024, busco me aprofundar cada vez mais no mundo da tecnologia e estou atraz sempre de algo mais difícil e complexo, pretendo cursar uma pós graduação em engenharia de software, logo após eu me formar na minha última graduação.",
  "graphic-design": "Design gráfico",
  "software-engineer": "Engenharia de software",
  "software-architecture": "Arquitetura de software",
  "home": "Início",
  "about": "Sobre mim",
  "skills": "Hábilidades",
  "portfolio": "Portifólio",
  "experience": "Experiência",

  "hi": "Olá, me chamo",
  "lucas": "Lucas e sou",
  "terminal-1": "olá seja bem vindo(a) ao meu site, aqui você verá uma apresentação minha e dos meus trabalhos na área da tecnologia",
  "terminal-2": "sobre mim",
  "terminal-3": "habilidades",
  "terminal-4": "portfolio",
  "terminal-5": "experience",
  "terminal-6": "curriculo",
  "terminal-7": "contato",
  "terminal-8": "aqui em baixo você vai ter uma breve descrição sobre mim ",

  "category": "Categoria",
  "all": "Todas",
  "database": "Banco de dados",
  "library": "Framework / Biblioteca",
  "language": "Linguagem",
  "see-more": "Ver mais",
  "more-projects": "Mais projetos",
  "experience-description": "Atualmente trabalho como desenvolvedor fullstack na Privacy, onde contribuo tanto para a plataforma principal de mídia social quanto para sistemas internos de suporte, utilizando tecnologias como Vue.js, Node.js, FastAPI e .NET. Anteriormente, atuei na ZNAP Technologies liderando projetos como planejamento orçamentário, gestão de leads e sistemas de fluxo de caixa, com integrações em plataformas como Netsuite e Totvs. Na Lumi, ajudei a desenvolver uma plataforma escalável de gestão de contratos de energia usando React, Node.js, GraphQL e FastAPI. Também trabalhei na Hypesoft, onde criei sistemas web, mobile e baseados em IA utilizando React Native, Flutter e Flask, atendendo clientes nas áreas de saúde, agricultura e mídia digital. Iniciei minha trajetória na ZB Software, desenvolvendo soluções web e mobile fullstack para projetos educacionais, de criptomoedas e plataformas de streaming.",
  "from": "De",
  "to": "Até",
  "responsible": "Responsábilidades",
  "about-button": "Sobre",
  "period": "Período",
  "init": "Início",
  "init-date": "Data de Início",
  "finish-date": "Data de Termino",
  "current": "Atualmente",
  "analysis-system": "Análise de sistemas",

  "finish": "Final",
  "exit": "Sair",
  "experience-1": "Desenvolvedor Frontend",
  "experience-2": "ZB Negócios Digitais",
  "experience-3": "Hábilidades utilizadas na função:",
  "experience-4": "Responsável pela criação de telas em HTML e React, integração de apis e desenvolvimento de sistemas em Javascript",
  "experience-5": "Sobre a empresa",
  "experience-6": "A ZB Negócios Digitais é uma rede de empresas que trabalha vários tipos de ramos dentro do mundo digital, como: marketing, sistemas de transações e análise de desempenho.",
  "design-course": "Curso superior - Design gráfico",
  "analist-course": "Curso superior - Análise e desenvolvimento de sistemas",
  "software-engineer-course": "Pós-graduação - Engenharia de software",
  "software-architecture-course": "MBA - Arquitetura de software",
  "university-center": "Centro Universitário Internacional",
  "puc-minas": "PUC Minas",
  "full-cycle": "Full Cycle",

  "institute": "Instituição",
  "teach-institute": "Instituição de ensino",
  "mec-grade": "Nota no mec",
  "mec-regulamentatation": "Confira a regulamentação no mec",
  "about-course": "Sobre o curso",
  "years": "anos",
  "duration": "Duração",
  "time-expended": "Carga horária",
  "curriculum-grade": "Grade curricular",
  "credential": "Credencial",
  "address": "Endereço",
  "code": "Código",
  "access-button": "Acessar",
  "repository": "Repositório",
  "deployment": "Em deploy",
  "search-tech": "Procure por alguma tecnologia",
  "search-category": "Procure por algum projeto, tecnologia ou categoria",
  "finished": "Finalizado",
  "in-course": "Em curso",
  "frontend": "Desenvolvedor Frontend",
  "month": "mês",
  "months": "meses",
  "year": "ano",
  "and": "e",

  "experience-1-2": "Desenvolvedor Fullstack",
  "experience-2-2": "Hypesoft",
  "experience-3-2": "Hábilidades utilizadas na função:",
  "experience-4-2": "Responsável pela criação de telas em HTML e React, integração de apis e desenvolvimento de sistemas em Javascript",
  "experience-5-2": "Sobre a empresa",
  "experience-6-2": "A ZB Negócios Digitais é uma rede de empresas que trabalha vários tipos de ramos dentro do mundo digital, como: marketing, sistemas de transações e análise de desempenho.",

  "experience-1-3": "Desenvolvedor Fullstack",
  "experience-2-3": "Lumi",
  "experience-3-3": "Hábilidades utilizadas na função:",
  "experience-4-3": "Responsável pela criação de telas em HTML e React, integração de apis e desenvolvimento de sistemas em Javascript",
  "experience-5-3": "Sobre a empresa",
  "experience-6-3": "A ZB Negócios Digitais é uma rede de empresas que trabalha vários tipos de ramos dentro do mundo digital, como: marketing, sistemas de transações e análise de desempenho.",

  "smurl-front": "Este projeto foi feito completamente por mim, com o objetivo de encurtar grandes links, apresentado minha hábilidades de manipulação de dados, arquitetura de dados, consumo de dados do graphql no Front-end e conhecimento em javascript em geral.",
  "smurl-back": "Nesta aplicação Back-end foi feita exclusivamente para o projeto de Front-end, sua principal função é cadastro e login de usuário, recuperação de senha, autênticação com o Google, Facebook e Github, além de edição do usuário e manipulação das urls.",
  "socialoff-front": "Este projeto foi criado para suprir as necessidades de download de conteúdos das redes sociais, onde não permitem fazer o download a partir dela, suas requisições demoram de 1 a 30 segundos.",
  "socialoff-back": "A parte do Back-end deste projeto tem o objetivo de capturar a url e o tipo de rede social escolhida e fazer o trabalho de web scrapping e por fim retornar o link afim da pessoa baixar no próprio dispositivo.",
  "arcade-front": "Este site foi construido com Javascript para mostrar habolidades com javascript canvas e criar jogos divertidos e abordar temas avançados em relação a Javascript.",
  "gameplay-mobile": "Este aplicativo foi feito durante um evento da rocket seat na trilha de react native, criando uma aplicação completa com o Back-end dentro do Front-end com o tema de controle de jogos a partir de grupos no Discord, podendo ser utilizada offline.",
  "serverless-back": "A aplicação serverless foi construida com a arquitetura serverless, contruída durante o curso de especialização em Nodejs, nela é possível gerar um certificado com nome, nota e id do usuário, estilizado com Handlebars.",
  "rentalx-back": "O Rentalx é um projeto feito no curso de especialização de Nodejs da Rocketseat, criando inúmeras ações para gerenciamento de uma locadora de automóveis como proprietário do negócio ou como usuário comum.",
  "devnews-front": "Esta aplicação foi feita somente no Front-end no curso de especialização em React da Rocketseat com autênticação com o Github, controlando o acesso do usuário, a partir do seu plano de pagamento, podendo ser de graça ou pago.",
  "overzap-back": "O Overzap é uma automatização do Whatsapp com o objetivo de atender clientes de um restaurante de delivery a partir de mensagens e amazenando suas informações no banco de dados.",
  "heatapp-mobile": "O Heat App é um aplicativo criado em React Native criado durante o evento da Rocketseat da NLW, seu objetivo é promover um evento de programação mostrando comentários de participantes de evento e o seu perfil de usuário autênticado com o Github.",
  "dashgo-front": "Este projeto foi criado no curso de especialização em React da Rocketseat, ele é uma plataforma de crm que permite o usuário fazer login e cadastrar, editar e excluir seus dados.",
  "finapi-back": "A Finapi é uma aplicação que foi feita no curso de especialização de Nodejs da Rocketseat com o objetivo de permitir com que as pessoas consigam organizar seu dinheiro a partir da api.",
  "heatreact-front": "Este projeto foi feito no evento da Rocketseat NLW em que criava uma versão web para promoção de um evento de programação, onde é possível visualizar comentários de participantes e visualizar seu perfil de usuário.",
  "influencerpack-front": "Este site foi feito para ajudar a promover um produto de consultoria de influencer, feito completamente com html, css e javascript.",
  "mymoney-front": "O MyMoney é um site de controle financeiro feito durante o curso de especialização em React da Rocketseat , ele permite que os usuário possam organizar o controle financeiro a partir de tabelas de gastos e calculos automatizados de gastos e dinheiro total.",
  "friends-back": "Esta api foi criada durante o evento NLW da Rocketseat, com o objetivo de ser uma aplicação de conexão de pessoas que possuam ou queiram ter um vinculo com outras pessoas, como uma rede social.",
  "spotify-front": "Este site é um clone do Spotify, feito com o propósito de mostrar hábilidades com html, css e javascript.",
  "heatnode-back": "A api Heat foi criada durante o evento NLW da Rocketseat, com o objetivo se ser integrada com o site e o aplicativo feito afim de promover um evento de programação, a api apresenta as funcionalidades de autênticação com o github e gerenciamento de mensagens enviadas pelos usuários no banco de dados.",
  "coffeecode-front": "O Coffee&Code é um projeto que foi criado como sugestão de uma startup do ramo de lanchonetes, sendo criado totalmente em html, css e javascript focando na área do Front-end.",
  "overfy-front": "Este site foi criado durante o evento da NLW da Rocketseat, promovendo uma agência de viagens, com tela inicial e tela de cadastro, com funcionalidades extras.",
  "hypesoft-front": "Este projeto é um desafio da Hypesoft, com o objetivo de testar hábilidades front-end do desenvolvedor, em que é necessáro desenvolver uma apresentação a empresa conforme o design proposto com nextjs e styled components.",
  "mks-front": "Este site de ecommerce é um desafio front-end da empresa MKS desenvolvimento de sistemas"
}
